# READ THE DATA

In [2]:
import pandas as pd
df = pd.read_excel("weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

# EXPLORING DATA

In [4]:
df.head()

        Date      City  Temperature_C  Humidity_% Condition
0 2025-01-01  Hyderbad             28          60     Sunny
1 2025-01-02  Hyderbad             29          62     Sunny
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [5]:
df.head(10)

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [6]:
df.tail()

        Date        City  Temperature_C  Humidity_% Condition
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           10 non-null     datetime64[ns]
 1   City           10 non-null     object
 2   Temperature_C  10 non-null     int64
 3   Humidity_%     10 non-null     int64
 4   Condition      10 non-null     object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 532.0+ bytes

In [8]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
df.dtypes

Date             datetime64[ns]
City                     object
Temperature_C             int64
Humidity_%                int64
Condition                object
dtype: object

In [11]:
df.Date

0   2025-01-01
1   2025-01-02
2   2025-01-03
3   2025-01-04
4   2025-01-05
5   2025-01-06
6   2025-01-07
7   2025-01-08
8   2025-01-09
9   2025-01-10
Name: Date, dtype: datetime64[ns]

In [12]:
df.shape

(10, 5)

In [13]:
df[2:5]

        Date      City  Temperature_C  Humidity_% Condition
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [14]:
df[['Date','Condition']]

        Date Condition
0 2025-01-01     Sunny
1 2025-01-02     Sunny
2 2025-01-03    Cloudy
3 2025-01-04    Cloudy
4 2025-01-05     Rainy
5 2025-01-06     Rainy
6 2025-01-07     Sunny
7 2025-01-08    Cloudy
8 2025-01-09     Rainy
9 2025-01-10     Sunny

In [15]:
temp_df = pd.DataFrame({
    "city":["kakinada","anakapalli","machilipatnam","vizag","pallevelugu"],
    "temperature":[28,29,30,31,32]
})
temp_df

            city  temperature
0       kakinada           28
1     anakapalli           29
2  machilipatnam           30
3          vizag           31
4    pallevelugu           32

In [16]:
temp_df.head()

            city  temperature
0       kakinada           28
1     anakapalli           29
2  machilipatnam           30
3          vizag           31
4    pallevelugu           32

In [17]:
temp_df.head(10)

            city  temperature
0       kakinada           28
1     anakapalli           29
2  machilipatnam           30
3          vizag           31
4    pallevelugu           32

In [18]:
temp_df.tail()

            city  temperature
0       kakinada           28
1     anakapalli           29
2  machilipatnam           30
3          vizag           31
4    pallevelugu           32

In [19]:
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         5 non-null      object
 1   temperature  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [20]:
temp_df.columns

Index(['city', 'temperature'], dtype='object')

In [21]:
temp_df.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
temp_df.dtypes

city           object
temperature     int64
dtype: object

In [23]:
temp_df.shape

(5, 2)

In [24]:
temp_df[1:3]

            city  temperature
1     anakapalli           29
2  machilipatnam           30

In [25]:
df.isnull()

    Date   City  Temperature_C  Humidity_%  Condition
0  False  False          False       False      False
1  False  False          False       False      False
2  False  False          False       False      False
3  False  False          False       False      False
4  False  False          False       False      False
5  False  False          False       False      False
6  False  False          False       False      False
7  False  False          False       False      False
8  False  False          False       False      False
9  False  False          False       False      False

In [26]:
df = pd.DataFrame({
    "name":["Rupesh","Charan","Sree Ram"],
    "age":[19,20,None]
})
df

       name   age
0    Rupesh  19.0
1    Charan  20.0
2  Sree Ram   NaN

In [27]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False   True

In [28]:
df.isnull().sum()

name    0
age     1
dtype: int64

In [29]:
df[df.isnull().any(axis=1)]

       name  age
2  Sree Ram  NaN

In [30]:
df['age'] = df['age'].fillna(df['age'].mean())

In [31]:
df

       name   age
0    Rupesh  19.0
1    Charan  20.0
2  Sree Ram  19.5

In [32]:
df_clean = df.dropna()

In [33]:
df_clean

       name   age
0    Rupesh  19.0
1    Charan  20.0
2  Sree Ram  19.5